module.exports={
	month:["月份1","月份2","月份3","月份4","月份5","月份6","月份7","月份8","月份9","月份10","返回"],
	areaName:["1区域","2区域","3区域","4区域","5区域","6区域","7区域","8区域","9区域","10区域","11区域","12区域"],
	areaRecordProfit:[18,8,12,14,7,12,10,18,19,10,11,18],
	areaRecordCost:[17,7,11,12,5,11,4,15,13,5,6,13],
	windFiled:["1风场","2风场","3风场","4风场","5风场","6风场","7风场","8风场","9风场","10风场","11风场","12风场"],
	windProfit:[18,8,12,14,7,12,10,18,19,10,11,18],
	windCost:[17,7,11,12,5,11,4,15,13,5,6,13],
	fan:["1风机","2风机","3风机","4风机","5风机","6风机","7风机","8风机","9风机","10风机","11风机","12风机"],
	fanProfit:[18,8,12,14,7,12,10,18,19,10,11,18],
	fanCost:[17,7,11,12,5,11,4,15,13,5,6,13],
	button:["前10",'后10',"更多"],

}
