module.exports = {
    comps:{
        from:[

            {
                type: 'select',
                content: '这是一个下拉选择框',
                id: 'input3',
                valueName:'告警级别',
                select: [
                    '全部',
                    '提示',
                    '警告',
                    '故障',
                ]
            },
            {
                type: 'select',
                content: '这是一个下拉选择框',
                id: 'input4',
                valueName:'设备类型',
                select: [
                    '全部',
                    'GM/85-2500',
                    'GM/87-1500',
                    'GM/85-2500',
                    'GM/85-2500',
                ]
            },
            {
                type: 'select',
                content: '这是一个下拉选择框',
                id: 'input5',
                valueName:'确认',
                select: [
                    '全部',
                    '是',
                    '否',
                ]
            },
            {
                type: 'select',
                content: '这是一个下拉选择框',
                id: 'input6',
                valueName:'确认人',
                select: [
                    '全部',
                    '刘琦',
                    '王鹏',
                    '张三',
                    '李四',
                ]
            },
            {
                type: 'date',
                content: '这是一个时间选择框',
                id: 'date',
                width: 120,
                height:30,
            },
            {
                type: 'input',
                valueName:'角色名称',
                content: '可输入关键字',
                id: 'input7',
                width:120
            },
            {
                type: 'input',
                valueName:'描述',
                content: '可输入关键字',
                id: 'input8',
                width:120
            },
            {
                type: 'button',
                content: '这是一个button',
                id: 'button',
                title: '查询',
            },
            {
                type: 'chcekBox',
                content: '这是一个确认框',
                id: 'input3',
                title: '这是一个确认框'
            },

        ],
        chart:[

        ],
        table:[

        ]
    },
    ammData:{
        header:[
            '用户名',
            '用户别名',
            '密码',
            '电话号码',
            '邮箱',
            '登录方式',
            '备注',
            '角色',


        ],
        content:[
            [12,13,14,15,16,17,18,19],
            [22,23,24,25,26,27,28,29],
            [32,33,34,35,36,37,38,39],
            [42,43,44,45,46,47,48,49],
            [52,53,54,55,56,57,58,59],
            [62,63,64,65,66,67,68,69],
            [72,73,74,75,76,77,78,79],
            [82,83,84,85,86,87,88,89],
            [92,93,94,95,96,97,98,99],
            [102,103,104,105,106,107,108,109],
            [102,103,104,105,106,107,108,109],
        ],
    },
    msData:{
        header:[
            '角色名称',
            '描述',
            '角色菜单',
            '实时监控',
            '生产管理',
            '健康管理',
            '业务分析',
           
        ],
        content:[
            [12,13,14,15,16,17,18,],
            [22,23,24,25,26,27,28,],
            [32,33,34,35,36,37,38,],
            [42,43,44,45,46,47,48,],
            [52,53,54,55,56,57,58,],
            [62,63,64,65,66,67,68,],
            [72,73,74,75,76,77,78,],
            [82,83,84,85,86,87,88,],
            [92,93,94,95,96,97,98,],
            [102,103,104,105,106,107,108,],
        ],
    }
};
