module.exports = {
	 comps:{
        from:[
            
            {
                type: 'select',
                content: '这是一个下拉选择框',
                id: 'input3',
                valueName:'设备类型',
                select: [{
                        name:'风机',
                        arr:[
                          {
                            name:'东北区1',
                            arr:[
                                {
                                  name:'华冉',
                                  arr:[12,24,54]
                                },
                                 {
                                  name:'小草胡',
                                  arr:[12,24,54]
                                },
                            ]
                        },
                        
                          {
                            name:'华南区1',
                            arr:[
                                 {
                                  name:'暴力流和',
                                  arr:[12,24,54]
                                },
                                 {
                                  name:'木磊赵壁山',
                                  arr:[12,24,54]
                                },
                            ]
                        }
                        
                        ],
    
                       },
                      {
                        name:'光伏站',
                        arr:{
                        
                            '东北区1':{
                                '华冉1':{
                                    '馈线1':{
                                        '风机1':['C1-01','C2-01','C3-01'],
                                        '风机2':['C1-01','C2-01','C3-01'],
                                        '风机2':['C1-01','C2-01','C3-01'],
                                           },
                                    '馈线2':{
                                        '风机1':['C1-01','C2-01','C3-01'],
                                        '风机2':['C1-01','C2-01','C3-01'],
                                        '风机2':['C1-01','C2-01','C3-01'],
                                           },
                                    },
                                '小草湖1':{
                                    '馈线1':{
                                        '风机1':['C1-01','C2-01','C3-01'],
                                        '风机2':['C1-01','C2-01','C3-01'],
                                        '风机2':['C1-01','C2-01','C3-01'],
                                            },
                                    '馈线2':{
                                        '风机1':['C1-01','C2-01','C3-01'],
                                        '风机2':['C1-01','C2-01','C3-01'],
                                        '风机2':['C1-01','C2-01','C3-01'],
                                           },
                                    },
                            },
                            '华南区1':{
                                '阜新穆雷1':{
                                    '馈线1':{
                                        '风机1':['C1-01','C2-01','C3-01'],
                                        '风机2':['C1-01','C2-01','C3-01'],
                                        '风机2':['C1-01','C2-01','C3-01'],
                                    },
                                    '馈线2':{
                                        '风机1':['C1-01','C2-01','C3-01'],
                                        '风机2':['C1-01','C2-01','C3-01'],
                                        '风机2':['C1-01','C2-01','C3-01'],
                                    },
                                },
                                '照壁山1':{
                                    '馈线1':{
                                        '风机1':['C1-01','C2-01','C3-01'],
                                        '风机2':['C1-01','C2-01','C3-01'],
                                        '风机2':['C1-01','C2-01','C3-01'],
                                    },
                                    '馈线2':{
                                        '风机1':['C1-01','C2-01','C3-01'],
                                        '风机2':['C1-01','C2-01','C3-01'],
                                        '风机2':['C1-01','C2-01','C3-01'],
                                    },
                                },
                            },
                        
                       }, 
                     }
                ],
            },
           
            {
                type: 'date',
                content: '这是一个时间选择框',
                id: 'date',
                width: 120,
                height:30,
            },
            
            {
                type: 'button',
                content: '这是一个button',
                id: 'button',
                title: '查询',
            },
            {
                type: 'button',
                content: '这是一个button',
                id: 'button',
                title: '显示/隐藏',
            },
            {
                type: 'button',
                content: '这是一个button',
                id: 'button',
                title: '导出Excel',
            },
            
        ],
        chart:[

        ],
        table:[

        ]
    }


};