module.exports = {
    data:{
        header:[
            '场站名称',
            '升压站状态',
            'AVC状态',
            'AGC状态',
            '计划功率MW',
            '装机容量MW',
            '出力MW',
            '负荷MW',
        ],
        content:[
            ['01风电场',0,1,0,164,190,178,168],
            ['02风电场',1,0,1,25,26,29,210],
            ['03风电场',0,0,1,35,38,39,310],
            ['04风电场',1,1,1,45,48,49,410],
            ['05光伏站',1,0,0,55,58,59,510],
            ['06光伏站',1,1,0,67,68,69,610],
       
        ],
    }
};
